**MAESTRÍA EN INTELIGENCIA ARTIFICIAL APLICADA**

**Curso: TC4029 - Ciencia y analítica de datos**

Tecnológico de Monterrey

Prof Grettel Barceló Alonso

**Semana 3**
Bases, almacenes y manipulación de datos

---

*   NOMBRE: LUIS ANGEL SEDA MARCOS
*   MATRÍCULA: A01795301

---

En esta actividad usarás la base de datos relacional `classicmodels` (MySQL), compuesta por las siguientes tablas:

*   `Customers`: almacena los datos de los clientes.
*   `Products`: almacena una lista de modelos de coches a escala.
*   `ProductLines`: almacena una lista de categorías de líneas de productos.
*   `Orders`: almacena los pedidos de venta realizados por los clientes.
*   `OrderDetails`: almacena elementos de línea de pedidos de ventas para cada pedido de ventas.
*   `Payments`: almacena los pagos realizados por los clientes en función de sus cuentas.
*   `Employees`: almacena toda la información de los empleados, así como la estructura de la organización, como quién informa a quién.
*   `Offices`: almacena los datos de la oficina de ventas.

Revisa con detalle su esquema para que comprendas cómo se relacionan las tablas anteriores.

Recuerda que:


*   Una **clave primaria** es un atributo (o conjunto) que identifica unívocamente a cada registro en la tabla.
*   Una **clave foránea** (externa o ajena) es un atributos (o conjunto) en una tabla que es una clave primaria en otra (o posiblemente la misma) tabla.
*   Las **relaciones** son las líneas que conectan una tabla con otra y el extremo determina la cardinalidad. Las relaciones con línea continua (identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser foránea y primaria (al mismo tiempo) de otra. Las relaciones con línea discontinua (no identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser sólo foránea en otra.

# **Parte 1**. SQLAlchemy y SQL básico

In [59]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\angel\anaconda3\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [60]:
import sqlalchemy as sqla
import pymysql
import pandas as pd

1.	Crea el motor `sqlalchemy`, con el método `create_engine()` y una conexión con `connect()` como se muestra a continuación:

In [61]:
# Crear el motor (dialecto://usuarioBD:clave@ipHostDBMS:puerto/esquema
db = sqla.create_engine('mysql+pymysql://mnaTC4029User:mnaTC4029Pass!@20.106.157.52:3306/classicmodels', pool_recycle=3600)

# Crea una conexión para luego invocar declaraciones SQL
conn = db.connect()

Escribe las consultas en SQL para obtener:

2.	La información de las líneas de productos.

In [62]:
qry_product_line=' SELECT * FROM productlines'
cursor = conn.execute(qry_product_line)
slct_product_line = cursor.fetchall()
slct_product_line

[('Classic Cars', 'Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking for classic muscle cars, dream sports cars or mo ... (437 characters truncated) ... cles. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.', None, None),
 ('Motorcycles', 'Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends such as Harley Davidson, Ducati and Vespa. Models ... (297 characters truncated) ...  out-of-production vehicles. All models come fully assembled and ready for display in the home or office. Most include a certificate of authenticity.', None, None),
 ('Planes', 'Unique, diecast airplane and helicopter replicas suitable for collections, as well as home, office or classroom decorations. Models contain stunning  ... (55 characters truncated) ... jet engines and propellers, retractable wheels, and so on. Most come fully assembled and with a certificate of authenticity from their manufacturers.', None, None),
 ('Ships', 'The perfect holiday or anniversary gift for executives, clients, friends, and family. These handcrafted model ships are unique, stunning works of art ... (12 characters truncated) ... e treasured for generations! They come fully assembled and ready for display in the home or office. We guarantee the highest quality, and best value.', None, None),
 ('Trains', "Model trains are a rewarding hobby for enthusiasts of all ages. Whether you're looking for collectible wooden trains, electric streetcars or locomoti ... (73 characters truncated) ... egory. The interactive aspect of trains makes toy trains perfect for young children. The wooden train sets are ideal for children under the age of 5.", None, None),
 ('Trucks and Buses', 'The Truck and Bus models are realistic replicas of buses and specialized trucks produced from the early 1920s to present. The models range in size fr ... (124 characters truncated) ... n, diecast and plastic. All models include a certificate of authenticity from their manufacturers and are a perfect ornament for the home and office.', None, None),
 ('Vintage Cars', 'Our Vintage Car models realistically portray automobiles produced from the early 1900s through the 1940s. Materials used include Bakelite, diecast, p ... (202 characters truncated) ... icas. All models include a certificate of authenticity from their manufacturers and come fully assembled and ready for display in the home or office.', None, None)]

3.	Los empleados ordenados por nombre.

In [63]:
qry_employees_name='''SELECT firstName, lastName FROM employees 
                      order by firstName asc'''
cursor = conn.execute(qry_employees_name)
slct_employees_name = cursor.fetchall()
slct_employees_name

[('Andy', 'Fixter'),
 ('Anthony', 'Bow'),
 ('Barry', 'Jones'),
 ('Diane', 'Murphy'),
 ('Foon Yue', 'Tseng'),
 ('George', 'Vanauf'),
 ('Gerard', 'Bondur'),
 ('Gerard', 'Hernandez'),
 ('Jeff', 'Firrelli'),
 ('Julie', 'Firrelli'),
 ('Larry', 'Bott'),
 ('Leslie', 'Jennings'),
 ('Leslie', 'Thompson'),
 ('Loui', 'Bondur'),
 ('Mami', 'Nishi'),
 ('Martin', 'Gerard'),
 ('Mary', 'Patterson'),
 ('Pamela', 'Castillo'),
 ('Peter', 'Marsh'),
 ('Steve', 'Patterson'),
 ('Tom', 'King'),
 ('William', 'Patterson'),
 ('Yoshimi', 'Kato')]

4.	Los países donde hay oficinas.

In [64]:
qry_offices_country='''SELECT distinct country FROM offices'''
cursor = conn.execute(qry_offices_country)
slct_offices_country = cursor.fetchall()
slct_offices_country

[('USA',), ('France',), ('Japan',), ('Australia',), ('UK',)]

5.	El nombre y teléfono de los clientes de Nueva York (*NYC*).

In [65]:
qry_name_tel_customers="""
SELECT customerName,phone
FROM customers
WHERE city ='NYC'
"""
cursor = conn.execute(qry_name_tel_customers)
slct_name_tel_customers = cursor.fetchall()
slct_name_tel_customers

[('Land of Toys Inc.', '2125557818'),
 ('Muscle Machine Inc', '2125557413'),
 ('Vitachrome Inc.', '2125551500'),
 ('Classic Legends Inc.', '2125558493'),
 ('Microscale Inc.', '2125551957')]

6.	El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [66]:
qry_products_vendor="""
SELECT productCode, productName
FROM products
where productVendor = 'Gearbox Collectibles'
and quantityInStock >= 1000
"""
cursor = conn.execute(qry_products_vendor)
slct_products_vendor = cursor.fetchall()
slct_products_vendor

[('S18_1889', '1948 Porsche 356-A Roadster'),
 ('S18_2238', '1998 Chrysler Plymouth Prowler'),
 ('S18_3482', '1976 Ford Gran Torino'),
 ('S18_3685', '1948 Porsche Type 356 Roadster'),
 ('S24_3432', '2002 Chevy Corvette'),
 ('S32_2206', '1982 Ducati 996 R'),
 ('S32_3207', "1950's Chicago Surface Lines Streetcar")]

7.	Los tres productos más caros, desde el punto de visto de los comercializadores (`buyPrice`).

In [67]:
qry_top3_expensive_products="""
SELECT productCode, productName
FROM products
ORDER BY buyPrice desc
LIMIT 3
"""
cursor = conn.execute(qry_top3_expensive_products)
slct_top3_expensive_products = cursor.fetchall()
slct_top3_expensive_products

[('S10_4962', '1962 LanciaA Delta 16V'),
 ('S18_2238', '1998 Chrysler Plymouth Prowler'),
 ('S10_1949', '1952 Alpine Renault 1300')]

8.	La cantidad de productos por línea de producto (no las existencias en inventario)

In [68]:
qry_products_per_productLine="""
SELECT prodlin.productLine,count(productCode)
FROM products prod 
JOIN productlines prodlin on prod.productLine = prodlin.productLine
GROUP BY prodlin.productLine
"""
cursor = conn.execute(qry_products_per_productLine)
slct_products_per_productLine = cursor.fetchall()
slct_products_per_productLine

[('Classic Cars', 38),
 ('Motorcycles', 13),
 ('Planes', 12),
 ('Ships', 9),
 ('Trains', 3),
 ('Trucks and Buses', 11),
 ('Vintage Cars', 24)]

9.	La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [69]:
qry_employee_per_country="""
SELECT off.country, count(emp.employeeNumber)
FROM employees emp 
JOIN offices off on emp.officeCode = off.officeCode
GROUP BY off.country
"""
cursor = conn.execute(qry_employee_per_country)
slct_employee_per_country = cursor.fetchall()
slct_employee_per_country

[('Australia', 4), ('France', 5), ('Japan', 2), ('UK', 2), ('USA', 10)]

10.	El promedio de los pagos de cada uno de los clientes de España.

In [70]:
qry_avg_payments="""
SELECT customerName, avg(amount)
FROM customers cust 
JOIN payments pay on pay.customerNumber = cust.customerNumber
WHERE country = 'Spain'
GROUP BY customerName
"""
cursor = conn.execute(qry_avg_payments)
slct_avg_payment = cursor.fetchall()
slct_avg_payment

[('CAF Imports', Decimal('23375.570000')),
 ('Corrida Auto Replicas, Ltd', Decimal('37480.030000')),
 ('Enaco Distributors', Decimal('22840.156667')),
 ('Euro+ Shopping Channel', Decimal('55056.844615')),
 ('Iberia Gift Imports, Corp.', Decimal('25493.925000'))]

# **Parte 2**. Manipulación de datos con Pandas

11.	Carga las tablas empleadas en dataframes con el mismo nombre y resuelve las consultas anteriores con las funciones de Pandas. Cuida no sobreescribir los dataframes originales al resolver las consultas. Debes obtener los mismos resultados que con SQL.

In [71]:
#productlines
tbl_productlines=' SELECT * FROM productlines'
cursor = conn.execute(tbl_productlines)
df_productlines = cursor.fetchall()
df_productlines = pd.DataFrame(df_productlines, columns=[x for x in cursor._metadata.keys])

In [72]:
#products
tbl_products=' SELECT * FROM products'
cursor = conn.execute(tbl_products)
df_products = cursor.fetchall()
df_products = pd.DataFrame(df_products, columns=[x for x in cursor._metadata.keys])

In [73]:
#orderdetails
tbl_orderdetails=' SELECT * FROM orderdetails'
cursor = conn.execute(tbl_orderdetails)
df_orderdetails = cursor.fetchall()
df_orderdetails = pd.DataFrame(df_orderdetails, columns=[x for x in cursor._metadata.keys])

In [74]:
#employees
tbl_employees=' SELECT * FROM employees'
cursor = conn.execute(tbl_employees)
df_employees = cursor.fetchall()
df_employees = pd.DataFrame(df_employees, columns=[x for x in cursor._metadata.keys])

In [75]:
#customers
tbl_customers=' SELECT * FROM customers'
cursor = conn.execute(tbl_customers)
df_customers = cursor.fetchall()
df_customers = pd.DataFrame(df_customers, columns=[x for x in cursor._metadata.keys])

In [76]:
#orders
tbl_orders=' SELECT * FROM orders'
cursor = conn.execute(tbl_orders)
df_orders = cursor.fetchall()
df_orders = pd.DataFrame(df_orders, columns=[x for x in cursor._metadata.keys])

In [77]:
#offices
tbl_offices=' SELECT * FROM offices'
cursor = conn.execute(tbl_offices)
df_offices = cursor.fetchall()
df_offices = pd.DataFrame(df_offices, columns=[x for x in cursor._metadata.keys])

In [78]:
#payments
tbl_payments=' SELECT * FROM payments'
cursor = conn.execute(tbl_payments)
df_payments = cursor.fetchall()
df_payments = pd.DataFrame(df_payments, columns=[x for x in cursor._metadata.keys])

In [79]:
#La información de las líneas de productos.
df_productlines

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,None,None
1,Motorcycles,Our motorcycles are state of the art replicas ...,None,None
2,Planes,"Unique, diecast airplane and helicopter replic...",None,None
3,Ships,The perfect holiday or anniversary gift for ex...,None,None
4,Trains,Model trains are a rewarding hobby for enthusi...,None,None
5,Trucks and Buses,The Truck and Bus models are realistic replica...,None,None
6,Vintage Cars,Our Vintage Car models realistically portray a...,None,None

In [80]:
#Los empleados ordenados por nombre.
df_employees[['firstName','lastName']].sort_values(by=['firstName'])

   firstName   lastName
17      Andy     Fixter
5    Anthony        Bow
16     Barry      Jones
0      Diane     Murphy
10  Foon Yue      Tseng
11    George     Vanauf
13    Gerard  Hernandez
4     Gerard     Bondur
2       Jeff   Firrelli
8      Julie   Firrelli
15     Larry       Bott
6     Leslie   Jennings
7     Leslie   Thompson
12      Loui     Bondur
20      Mami      Nishi
22    Martin     Gerard
1       Mary  Patterson
14    Pamela   Castillo
18     Peter      Marsh
9      Steve  Patterson
19       Tom       King
3    William  Patterson
21   Yoshimi       Kato

In [81]:
#Los países donde hay oficinas.
df_offices['country'].unique()

array(['USA', 'France', 'Japan', 'Australia', 'UK'], dtype=object)

In [82]:
#El nombre y teléfono de los clientes de Nueva York (NYC).
df_customers[['customerName','phone','city']].query('city == "NYC"').drop('city', axis = 1)

             customerName       phone
9       Land of Toys Inc.  2125557818
15     Muscle Machine Inc  2125557413
27        Vitachrome Inc.  2125551500
98   Classic Legends Inc.  2125558493
105       Microscale Inc.  2125551957

In [83]:
#El código y nombre de los productos del vendedor Gearbox Collectibles 
#que tengan menos de 1000 unidades en stock.
df_products[['productCode','productName','quantityInStock']].query('quantityInStock >= 1000').drop('quantityInStock', axis=1)

    productCode                            productName
0      S10_1678  1969 Harley Davidson Ultimate Chopper
1      S10_1949               1952 Alpine Renault 1300
2      S10_2016                  1996 Moto Guzzi 1100i
3      S10_4698   2003 Harley-Davidson Eagle Drag Bike
4      S10_4757                    1972 Alfa Romeo GTA
..          ...                                    ...
103   S700_2834                          ATA: B757-300
105   S700_3505                            The Titanic
106   S700_3962                         The Queen Mary
107   S700_4002              American Airlines: MD-11S
108    S72_1253                       Boeing X-32A JSF

[98 rows x 2 columns]

In [84]:
#Los tres productos más caros, desde el punto de visto de los comercializadores (buyPrice).
df_products.sort_values(by=['buyPrice'],ascending=False).iloc[0:3,1]

5             1962 LanciaA Delta 16V
25    1998 Chrysler Plymouth Prowler
1           1952 Alpine Renault 1300
Name: productName, dtype: object

In [85]:
#La cantidad de productos por línea de producto (no las existencias en inventario)
df_products_per_productline = pd.merge(df_productlines,df_products)
df_products_per_productline.groupby('productLine').productName.count()

productLine
Classic Cars        38
Motorcycles         13
Planes              12
Ships                9
Trains               3
Trucks and Buses    11
Vintage Cars        24
Name: productName, dtype: int64

In [86]:
#La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).
df_employees_per_country = pd.merge(df_employees,df_offices)
df_employees_per_country.groupby('country').employeeNumber.count()

country
Australia     4
France        5
Japan         2
UK            2
USA          10
Name: employeeNumber, dtype: int64

In [87]:
#El promedio de los pagos de cada uno de los clientes de España.

In [88]:
df_avg_payments=pd.merge(df_customers,df_payments)
df_avg_payments[df_avg_payments.country == 'Spain'].groupby('customerName').amount.mean()

customerName
CAF Imports                       23375.57
Corrida Auto Replicas, Ltd        37480.03
Enaco Distributors            22840.156667
Euro+ Shopping Channel        55056.844615
Iberia Gift Imports, Corp.       25493.925
Name: amount, dtype: object

# **Parte 3**. Cliente de Python Firestore

En esta fase te conectarás a una base de datos no relacional de Firestore desde Python. Para ello utilizarás los módulos `credentials` y `firestore` de la biblioteca `firebase_admin`.

In [89]:
import firebase_admin
from firebase_admin import credentials
from firebase_admin import firestore

El archivo `veterinary.json` almacena la clave privada para autenticar una cuenta y autorizar el acceso a los servicios de Firebase. A través de la función `Certificate()`, se regresa una credencial inicializada, que puedes utilizar para crear una nueva instancia de la aplicación. Después de eso, tu conexión a Firestore utilizará las reglas de seguridad establecidas para la base de datos y el usuario autenticado.

In [90]:
#from google.colab import drive
#drive.mount('/content/drive')

In [91]:
#import os
#DIR = "/content/drive/MyDrive/Colab Notebooks/MNA/TC4029 - Ciencia y analítica de datos/Semana 3/Actividad3_BD_Manipulacion"
#os.chdir(DIR)

In [94]:
cred = credentials.Certificate('veterinary.json')
firebase_admin.initialize_app(cred)
db = firestore.client()

12.	Investiga cómo leer la colección `PET_OWNER` y mostrar su contenido en un dataframe. Asegúrate de incluir el id en el resultado

In [95]:
#reading PET_OWNER
collection = db.collection('PET_OWNER').stream()

In [96]:
lista = [[]]
for data in collection:
    new=[f'{{}}'.format(data.id),f'{{}}'.format(data.get('email')),f'{{}}'.format(data.get('phone')),f'{{}}'.format(data.get('ownerFirstName')),f'{{}}'.format(data.get('ownerLastName'))]
    lista.append(new)

In [97]:
df = pd.DataFrame(lista)
df= df.dropna()
df

,0,1,2,3,4
1,0D6yFSs2eu4nYwf2dnQ0,None,555-454-3465,Sam,Taylor
2,98357ufgjmWUxjnAuzbz,miles.trent@somewhere.com,None,Miles,Trent
3,AFtZincSZxjC4Mcxf9Pf,liz.frier@somewhere.com,555-537-6543,Liz,Frier
4,GYDixDwHjMyihjL8TmsM,None,555-454-1243,Jenny,Mayberry
5,IpxTuB6FILhwQFcspLws,'marcha.downs@somewhere.com,555-537-8765,Marsha,Downs
6,QoXBfS1JdRp6BqgLzaAz,None,555-454-2354,Ken,Roberts
7,eUtZ44lPRbSHXX04EDp7,nigel.melnik@somewhere.com,555-232-5678,Nigel,Melnik
8,n2GG9rlfGOmE0P4TcU0T,richard.james@somewhere.com,555-537-7654,Richard,James
9,pDlJlul8EJXO8FBJvFkN,jim.rogers@somewhere.com,555-232-3456,Jim,Rogers
10,tAlJ74xQ7tT4TUHwZgmH,mary.keenan@somewhere.com,555-232-4567,Mary,Keenan

In [98]:
firebase_admin.delete_app(firebase_admin.get_app())